app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])

    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Birds"], ["updated_at", "2019-08-06 23:58:05.000551"], ["id", 3]]